BeautySalon_MobileApp/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BeautySalon_MobileApp/Documents/ЗаписьКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьСтоимостьУслуги(ВыбраннаяУслуга) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|ГДЕ
		|	Услуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбраннаяУслуга);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Стоимость
	КонецЕсли;
	                                                  
КонецФункции

&НаКлиенте
 Процедура УслугиУслугаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		Стоимость = ПолучитьСтоимостьУслуги(СтрокаТЧ.Услуга);
		СтрокаТЧ.Стоимость = Стоимость;
	Иначе
		СтрокаТЧ.Стоимость = 0;
	КонецЕсли;
	 
 КонецПроцедуры
